<script setup lang="ts">

import GeneralViewWrapper from "@/components/view/GeneralViewWrapper.vue";
import RedLinedHeader2 from "@/components/common/RedLinedHeader2.vue";
</script>

<template>
  <GeneralViewWrapper>
    <div class="text-page-wrapper">
      <h1>Відмова від відповідальності</h1>
      <p>На цій сторінці наведені важливі відомості, що стосуються редагування користувачами, використання зображень та
        ліцензії Creative Commons на сайті «СтаріФото.Укр». Ця сторінка має на меті пояснити правила та обмеження,
        пов'язані
        з контентом, що розміщений на сайті.</p>
      <p>Ми рекомендуємо уважно ознайомитися з цими правилами та використовувати інформацію з сайту «СтаріФото.Укр» з
        обізнаністю та відповідальністю. Звертайте увагу на джерела та авторство, а також дотримуйтеся ліцензійних умов
        використання контенту, що підпадає під ліцензію Creative Commons.</p>

      <RedLinedHeader2>Завантаження користувачами</RedLinedHeader2>
      <p>На сайті «СтаріФото.Укр» існує можливість завантаження контенту зареєстрованими користувачами. Ми робимо все
        можливе, щоб забезпечити точність та достовірність інформації, проте не несемо відповідальності за будь-які
        неточності або помилки, які можуть з'явитися в результаті редагування користувачами. Кожен користувач несе
        відповідальність за власні дії та внесені зміни.</p>

      <RedLinedHeader2>Зображення</RedLinedHeader2>
      <p>На сайті можуть бути розміщені зображення, які завантажують зареєстровані користувачі. Деякі зображення можуть
        мати
        зазначену вільну ліцензію. Однак, будь ласка, майте на увазі, що використання будь-яких зображень, які не мають
        вільної ліцензії або не задовольняють критеріям
        добропорядного користування, може порушувати авторські права. </p>

      <p>Для кожного випадку використання зазначеного зображення відповідно до критеріїв добропорядного користування,
        будь ласка, надайте детальне обґрунтування та вкажіть джерело зображення та інформацію про авторські права. </p>

      <RedLinedHeader2>Ліцензія Creative Commons</RedLinedHeader2>
      <p>Весь контент, який розміщений на сайті «СтаріФото.Укр», підпадає під ліцензію Creative Commons Attribution
        Share
        Alike, якщо не зазначено інше. Згідно цієї ліцензії, ви маєте право вільно поширювати та використовувати цей
        контент за умови, що ви зазначите джерело зі збереженням ліцензії Creative Commons.</p>

      <p>Будь ласка, дотримуйтеся цих умов щодо використання контенту, який підпадає під ліцензію Creative Commons
        Attribution Share Alike. Якщо ви плануєте використати цей контент на іншому ресурсі, важливо зазначити посилання
        на джерело та коректно відобразити авторство та збереження ліцензії Creative Commons. </p>

      <RedLinedHeader2>Відмова від відповідальності</RedLinedHeader2>
      <p>Ми намагаємося забезпечити якість та точність інформації на нашому сайті, проте не можемо гарантувати її повну
        вичерпність або безпомилковість. Будь ласка, пам'ятайте, що будь-яке використання інформації з сайту
        «СтаріФото.Укр»
        здійснюється на ваш власний ризик.
      </p>

      <p>З метою забезпечення найкращої якості, ми рекомендуємо перевіряти джерела і перевіряти достовірність
        інформації,
        зокрема ту, що стосується локальної історії. </p>

      <p>Якщо у вас виникнуть питання щодо відмови від відповідальності або використання контенту, будь ласка,
        зв'яжіться
        з нами за допомогою контактної інформації, наведеної на нашому Сайті. Ми завжди готові відповісти на ваші
        запитання та надати додаткову інформацію. </p>

    </div>
  </GeneralViewWrapper>
</template>

<style scoped lang="less">

</style>