<script setup lang="ts">

import GeneralViewWrapper from "@/components/view/GeneralViewWrapper.vue";
import RedLinedHeader2 from "@/components/common/RedLinedHeader2.vue";
</script>

<template>
  <GeneralViewWrapper>
    <div class="text-page-wrapper">
      <h1>Політика конфіденційності</h1>
      <p>Ваша приватність має велике значення для нас. Ця політика конфіденційності пояснює, як ми збираємо,
        використовуємо, захищаємо та розкриваємо інформацію, яку ми отримуємо від вас через веб-сайт «Аккерманіка» (далі
        — «Сайт»). </p>

      <RedLinedHeader2>Збір та використання інформації</RedLinedHeader2>
      <p>Ми збираємо інформацію, яку ви надаєте добровільно при реєстрації на Сайті або під час створення та редагування
        статей. Ця інформація може включати ваше ім'я, електронну пошту та інші контактні дані. </p>

      <p>Ми використовуємо зібрану інформацію для забезпечення доступу до функціональності Сайту, а також для зв'язку з
        вами щодо важливих питань, пов'язаних з використанням Сайту та редагуванням статей. </p>

      <RedLinedHeader2>Захист інформації</RedLinedHeader2>
      <p>Ми прикладаємо всі можливі зусилля для захисту вашої особистої інформації від несанкціонованого доступу,
        використання чи розголошення. Ми застосовуємо різноманітні технічні та організаційні заходи безпеки для
        забезпечення цього захисту. </p>

      <RedLinedHeader2>Розкриття інформації третім сторонам</RedLinedHeader2>
      <p>Ми не передаємо вашу особисту інформацію третім сторонам без вашої згоди, за винятком випадків, коли це
        необхідно виконанням законодавства або захисту наших прав чи прав третіх осіб. </p>

      <RedLinedHeader2>Посилання на інші веб-сайти</RedLinedHeader2>
      <p>Наш Сайт може містити посилання на інші веб-сайти, які не контролюються нами. Ми не несемо відповідальності за
        політику конфіденційності або дії цих сторон. Рекомендується ознайомитися з політикою конфіденційності кожного
        веб-сайту, на який ви переходите через посилання з нашого Сайту. </p>

      <RedLinedHeader2>Зміни до політики конфіденційності</RedLinedHeader2>
      <p>Ми можемо періодично оновлювати цю політику конфіденційності. Будь ласка, перевіряйте цю сторінку час від часу,
        щоб бути в курсі будь-яких змін. Продовжуючи використовувати Сайт після внесення змін в цю політику, ви
        підтверджуєте свою згоду з оновленою політикою конфіденційності. </p>

      <RedLinedHeader2>Зворотній зв'язок</RedLinedHeader2>
      <p>Якщо у вас виникнуть будь-які питання щодо цієї політики конфіденційності або нашого використання вашої
        інформації, будь ласка, зв'яжіться з нами за допомогою контактної інформації, наведеної на нашому Сайті. </p>
      <p>Дякуємо за використання Сайту «Аккерманіка» та довіру до нашої політики конфіденційності. Ми прагнемо
        забезпечити надійний захист вашої інформації та зробити ваше перебування на нашому Сайті приємним та
        цікавим. </p>
    </div>
  </GeneralViewWrapper>
</template>

<style scoped lang="less">

</style>